# DissociateFromGlobalParameter Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Parameter..::..DissociateFromGlobalParameter Method
Parameter Class See Also
---
Dissociates this parameter from a global parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016 Subscription Update
# Syntax
C#
---
```text
public void DissociateFromGlobalParameter()
```

Visual Basic
---
```text
Public Sub DissociateFromGlobalParameter
```

Visual C++
---
```text
public:
void DissociateFromGlobalParameter()
```

# Remarks
It is assumed this parameter has been previously associated with the global parameter by using the [!:AssociateWithGlobalParameter(Revit::DB::ElementId^)] method.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | This parameter does not exist in the document anymore. -or- This parameter is either not parameterizable or does not match the type of the global parameter. |

# See Also
Parameter Class
Autodesk.Revit.DB Namespace